import React from "react";
import './ProcessTimeline.css'

export default function IncidentReport() {
  const incidentDetails = [
    {
      title: "အချိန်၊နေရာ",
      content: "Date - 7/7/2026 - မနက်8နာရီဝန်းကျင်။မရမ်းကုန်းမြိုနယ်၊အမှတ်(၂) ရပ်ကွက်။ဦးဘအိုလမ်း။တိုက်အမှတ် ၁၄၇၊၄လွှာ (စုစုပေါင်း ၅လွှာရှိသည်။)"
    },
    
    {
      title: "ဖြစ်စဉ်",
      content:
        "တိုက်ခန်းတွင် လူသုံးယောက် နေထိုင်ပါသည်။ ဖြစ်စဉ်ဖြစ်ပွားချိန်တွင် ကျွန်တော်သည် အိပ်နေပါသည်။ အဖော်တစ်ဦးသည် ရေချိုးနေပြီး၊ အခြားတစ်ဦးမှာ ရုံးသွားရန်အတွက် တံခါးကို သော့မခတ်ဘဲ ထားခဲ့ကြောင်း သိရှိရပါသည်။"
    },
    {
      title: "ပစ္စည်းပျောက်ဆုံးမှု သိရှိခြင်း",
      content:
        "ရေချိုးနေသော အဖော်မှ အခြေအနေကို သတိပြုမိပြီး ကျွန်တော်အား နှိုး၍ အသိပေးခဲ့သဖြင့် ပစ္စည်းများ ပျောက်ဆုံးနေကြောင်း သိရှိခဲ့ပါသည်။ရုံးသွားသော အခန်းဖော် ရုံးသွားချိန်မှာ 7:45 ဝန်းကျင်ဟု သိရသည်။ ပစ္စည်းပျောက်ဆုံးသည်ကို 8:12 လောက်တွင် စတင်သိရပါသည်။ iCloud တွင် 8:30 ဝန်းကျင်လောက်တွင် စတင်ခြေရာခံမိပါသည်။ ပိုက်ဆံအိတ်၊ ကျွန်တော်၏အခြားဖုန်းတလုံးနှင့် နာရီများကို ချန်ခဲ့ပါသည်။"
    },
    
    {
      title: "သံသယရှိသူနှင့်အထောက်အထားများ",
      content:
        "ဖြစ်စဉ်နှင့် ပတ်သက်၍ သံသယရှိသူတစ်ဦးကို တွေ့ရှိထားပါသည်။ သံသယရှိသူနှင့် ပတ်သက်သော CCTV မှတ်တမ်းများလည်း ရရှိထားပါသည်။(သံသယရှိသူတိုက်ခမ်းလမ်းကြားသို့ဝင်သွားသော အချိန်နှင့် ထွက်လာသော အချိန်သည် ၄ မိနစ်ခန့်ကြာပါသည်)",
      items: [
        "CCTV မှတ်တမ်းများ",
        "ဖြစ်စဉ်ဖြစ်ပွားချိန် အချက်အလက်များ",
        "ပျောက်ဆုံးသော ဖုန်းများ၏ အချက်အလက်များ",
        "ရရှိထားသော အချက်အလက်များနှင့် အထောက်အထားများကို သက်ဆိုင်ရာ အာဏာပိုင်များ စစ်ဆေးနိုင်ရန် စုစည်းထားပါသည်။"
      ],
        link: "https://drive.google.com/drive/folders/1vLKo0ddsYqVQCV7MZ8QziGg0iCMh2A--"
    },
    {
      title: "တည်နေရာရွှေ့လျားပုံ",
      content: "ပထမဆုံးနေ့တွင် ဖုန်း၏တည်နေရာသည် သမိုင်းရပ်ကွက်နှင့် ပါရမီလမ်းအနီးတွင် ရွှေ့လျားနေခဲ့ပါသည်။ ထို့နောက် ၈ မိုင်အနီးရှိ ကျိုက်ဝိုင်းဘုရားလမ်းတွင် ရောက်ရှိခဲ့ပြီး ၄ နာရီခန့်ကြာအောင် တည်နေရာမပြောင်းလဲဘဲ ရှိနေခဲ့ပါသည်။ထိုနေ့တွင်ပင် ကမ္ဘာအေးလမ်းအနီးရှိ ဂန္ဓမာလမ်းတွင် ထပ်မံတည်နေရာပြသခဲ့ပြီး နောက်တစ်နေ့နံနက်အထိ ထိုနေရာတွင်ပင် ဆက်လက်ရှိနေခဲ့ပါသည်။၂၀၂၆ ခုနှစ်၊ ဇူလိုင်လ ၈ ရက်နေ့တွင် ကြည့်မြင်တိုင်မြို့နယ်၊ ဟံသာဝတီလမ်း၌ ခေတ္တတည်နေရာပြသခဲ့ပါသည်။ ထို့နောက် ဇူလိုင်လ ၉ ရက်နေ့တွင် တော်ဝင်လမ်း (၉ မိုင်) အနီးတွင် ထပ်မံပေါ်လာခဲ့ပြီး ၃ နာရီခန့်အကြာတွင် ခရေပင်လမ်းခွဲအနီးသို့ ရွှေ့လျားသွားကြောင်း တွေ့ရှိရပါသည်။နောက်ဆုံးအနေဖြင့် ည ၉ နာရီ ၅၀ မိနစ်ခန့်တွင် ရွှေပြည်သာမြို့နယ်၊ ရာဇာဓိရာဇ်လမ်းတွင် တည်နေရာပြသခဲ့ပြီး၊ ထိုနေရာသည် Find My မှ နောက်ဆုံးမှတ်တမ်းတင်ထားသော တည်နေရာဖြစ်ပါသည်။"
    },
    {
      title: "ပျောက်ဆုံးသော ပစ္စည်းများ",
      items: [
        "ကျွန်တော်၏ မိုဘိုင်းဖုန်းတစ်လုံး",
        "ကျွန်တော်၏ Laptop တလုံး",
        "အဖော်၏ မိုဘိုင်းဖုန်းတစ်လုံး"
      ]
    }
   
  ];

  return (
    <section className="process-section" id="process">
      <div className="section-title">
        <h2>Theft Incident Report</h2>
        <p>Victim Info</p>
        <p>Kaung Set Paing <br />
          Mandalay Computer ကျောင်းမှ ကျောင်းပီးမြောက်ရန်အတွက် Yangon တွင်  ၂လ (April 10 -July 10)အလုပ်သင် လာဆင်းရန် Share Room တွင်နေထိုင်စင်ဖြစ်ပွားခြင်း
        </p>
      </div>

      <div className="timeline-container">
        {incidentDetails.map((section, index) => (
          <div className="timeline-card" key={index}>
            <div className="timeline-header">
              <span className="step-badge">
                Step {index + 1}
              </span>

              <span className="step-time">
                Evidence
              </span>
            </div>

            <div className="timeline-body">
              <h3>{section.title}</h3>

              {section.content && (
                <p>{section.content}</p>
              )}

              {section.items && (
                <ul>
                  {section.items.map((item, i) => (
                    <li key={i}>{item}</li>
                  ))}
                </ul>
              )}

              {section.link && (
                <div style={{ marginTop: "1rem" }}>
                  <a 
                    href={section.link} 
                    target="_blank" 
                    rel="noopener noreferrer" 
                    className="see-location-btn"
                    style={{ textDecoration: "none", display: "inline-flex", alignItems: "center" }}
                  >
                    မှတ်တမ်းများကြည့်ရန်
                  </a>
                </div>
              )}
            </div>
          </div>
        ))}
      </div>
    </section>
  );
}